//#;*****************************************************************************
//#;
//#; Copyright 2015 - 2018 ADVANCED MICRO DEVICES, INC.  All Rights Reserved.
//#;
//#; AMD is granting you permission to use this software (the Materials)
//#; pursuant to the terms and conditions of your Software License Agreement
//#; with AMD.  This header does *NOT* give you permission to use the Materials
//#; or any rights under AMD's intellectual property.  Your use of any portion
//#; of these Materials shall constitute your acceptance of those terms and
//#; conditions.  If you do not agree to the terms and conditions of the Software
//#; License Agreement, please do not use any portion of these Materials.
//#;
//#; CONFIDENTIALITY:  The Materials and all other information, identified as
//#; confidential and provided to you by AMD shall be kept confidential in
//#; accordance with the terms and conditions of the Software License Agreement.
//#;
//#; LIMITATION OF LIABILITY: THE MATERIALS AND ANY OTHER RELATED INFORMATION
//#; PROVIDED TO YOU BY AMD ARE PROVIDED "AS IS" WITHOUT ANY EXPRESS OR IMPLIED
//#; WARRANTY OF ANY KIND, INCLUDING BUT NOT LIMITED TO WARRANTIES OF
//#; MERCHANTABILITY, NONINFRINGEMENT, TITLE, FITNESS FOR ANY PARTICULAR PURPOSE,
//#; OR WARRANTIES ARISING FROM CONDUCT, COURSE OF DEALING, OR USAGE OF TRADE.
//#; IN NO EVENT SHALL AMD OR ITS LICENSORS BE LIABLE FOR ANY DAMAGES WHATSOEVER
//#; (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, BUSINESS
//#; INTERRUPTION, OR LOSS OF INFORMATION) ARISING OUT OF AMD'S NEGLIGENCE,
//#; GROSS NEGLIGENCE, THE USE OF OR INABILITY TO USE THE MATERIALS OR ANY OTHER
//#; RELATED INFORMATION PROVIDED TO YOU BY AMD, EVEN IF AMD HAS BEEN ADVISED OF
//#; THE POSSIBILITY OF SUCH DAMAGES.  BECAUSE SOME JURISDICTIONS PROHIBIT THE
//#; EXCLUSION OR LIMITATION OF LIABILITY FOR CONSEQUENTIAL OR INCIDENTAL DAMAGES,
//#; THE ABOVE LIMITATION MAY NOT APPLY TO YOU.
//#;
//#; AMD does not assume any responsibility for any errors which may appear in
//#; the Materials or any other related information provided to you by AMD, or
//#; result from use of the Materials or any related information.
//#;
//#; You agree that you will not reverse engineer or decompile the Materials.
//#;
//#; NO SUPPORT OBLIGATION: AMD is not obligated to furnish, support, or make any
//#; further information, software, technical information, know-how, or show-how
//#; available to you.  Additionally, AMD retains the right to modify the
//#; Materials at any time, without notice, and is not obligated to provide such
//#; modified Materials to you.
//#;
//#; U.S. GOVERNMENT RESTRICTED RIGHTS: The Materials are provided with
//#; "RESTRICTED RIGHTS." Use, duplication, or disclosure by the Government is
//#; subject to the restrictions as set forth in FAR 52.227-14 and
//#; DFAR252.227-7013, et seq., or its successor.  Use of the Materials by the
//#; Government constitutes acknowledgement of AMD's proprietary rights in them.
//#;
//#; EXPORT ASSURANCE:  You agree and certify that neither the Materials, nor any
//#; direct product thereof will be exported directly or indirectly, into any
//#; country prohibited by the United States Export Administration Act and the
//#; regulations thereunder, without the required authorization from the U.S.
//#; government nor will be used for any purpose prohibited by the same.
//#;******************************************************************************
/=#
#langdef en-US "English"

#string STR_AMD_PBS_SETUP_TITLE                           #language en-US "AMD PBS"
#string STR_AMD_PBS_SETUP_TITLE_HELP                      #language en-US "AMD PBS Setup Page"

#string STR_AMD_PBS_SETUP_FORM_TITLE                      #language en-US "AMD PBS Option"


#string STR_BLANK_STRING                                  #language en-US " "
#string STR_USER_MANUAL_TEXT                              #language en-US "Manual"

#string STR_ENABLED_TEXT                                  #language en-US "Enabled "
#string STR_ENABLED_X4_TEXT                               #language en-US "Enabled (x4)"
#string STR_ENABLED_X2_TEXT                               #language en-US "Enabled (x2) (Lane 0 + 1)"
#string STR_ENABLED_X1_TEXT                               #language en-US "Enabled (x1) (Lane 0)"
#string STR_DISABLED_TEXT                                 #language en-US "Disabled"
#string STR_AUTO_TEXT                                     #language en-US "Auto"

#string STR_SPECIAL_VGA_FEATURE_STRING                    #language en-US "Special Display Features"
#string STR_SPECIAL_VGA_FEATURE_HELP                      #language en-US "Enable/Disable HybridGraphics"
#string STR_HG_TEXT                                       #language en-US "HybridGraphics"
#string STR_DGPU_HOTPLUG_MODE_STRING                      #language en-US "Discrete GPU Hotplug Mode"
#string STR_DGPU_HOTPLUG_MODE_HELP                        #language en-US "Select Discrete GPU Hotplug Mode - HotplugEnhanced or HotplugBasic"

#string STR_NON_EVAL_DGPU_SUPPORT_STRING                  #language en-US "Non-Eval Discrete GPU Support"
#string STR_NON_EVAL_DGPU_SUPPORT_HELP                    #language en-US "Enable to support Non-Eval Discrete GPU that doesn't have specific EVAL_PWRGD(A5), EVAL_PRESENT#(B30)"

#string STR_SPECIAL_VGA_FEATURE_STRING                    #language en-US "Special Display Features"
#string STR_SPECIAL_VGA_FEATURE_HELP                      #language en-US "Enable/Disable          PowerXpress             HybridGraphics"

#string STR_DGPU_AUDIO_STRING                             #language en-US "Discrete GPU's Audio"
#string STR_DGPU_AUDIO_HELP                               #language en-US "Disable Discrete GPU's Audio is enabled or keep its HW default setting"
#string STR_HW_DEFAULT_TEXT                               #language en-US "Keep HW Default Setting"
#string STR_PX_DYNAMICMODE_HELP                           #language en-US "Enable/Disable PX Dynamic Mode Switch"
#string STR_PX_DYNAMICPWRDWN_STRING                       #language en-US "dGPU Power Down"
#string STR_PWR_DOWN_RST_DOWN_STRING                      #language en-US "PWROFF-RST Timing (ms)"
#string STR_PWR_DOWN_RST_DOWN_HELP                        #language en-US "PWROFF-RST Timing: PWR_EN deassert to PERSTb assert"

#string STR_PWR_UP_RST_UP_STRING                          #language en-US "PWRON-RST Timing  (ms)"
#string STR_PWR_UP_RST_UP_HELP                            #language en-US "PWRON-RST Timing: PWR_EN assert to PERSTb deassert"

#string STR_PRIMARY_VIDEO_ADAPTOR_PROMPT                  #language en-US "Primary Video Adaptor"
#string STR_PRIMARY_VIDEO_ADAPTOR_HELP                    #language en-US "Select Internal/External Graphics"
#string STR_INT_GRAPHICS                                  #language en-US "Int Graphics (IGD)"
#string STR_EXT_PCIE_GRAPHICS                             #language en-US "Ext Graphics (PEG)"

#string STR_UCSI_STRING                                   #language en-US "UCSI Support"
#string STR_UCSI_HELP                                     #language en-US "Enable/Disable UCSI (USB Type-C Connector System Software Interface)"

#string STR_MODERN_STANDBY_STRING                         #language en-US "Modern Standby Support"
#string STR_MODERN_STANDBY_HELP                           #language en-US "Enable/Disable Modern Standby. Please disable ACPI S3 support when Modern Standby enabled."

#string STR_REDUCE_HARDWARE_STRING                        #language en-US "Reduce Hardware Support"
#string STR_REDUCE_HARDWARE_HELP                          #language en-US "Enable/Disable Reduce Hardware Support. Please disable PME wakeup, when Reduce Hardware enabled."

#string STR_UNUSED_GPPCLK_OFF_STRING                      #language en-US "Unused GPP Clocks Off"
#string STR_UNUSED_GPPCLK_OFF_HELP                        #language en-US "Turn Unused GPP Clocks Off"
#string STR_CLKREQ_WLAN_STRING                            #language en-US "Clock PM: CLK_REQ0"
#string STR_CLKREQ_WLAN_HELP                              #language en-US "Enable or disable CLK_REQ0# for M.2 WLAN Slot J3711"
#string STR_CLKREQ_LAN_STRING                             #language en-US "Clock PM: CLK_REQ1"
#string STR_CLKREQ_LAN_HELP                               #language en-US "Enable or disable CLK_REQ1# for Onboard LAN U1301"
#string STR_CLKREQ_WWAN_STRING                            #language en-US "Clock PM: CLK_REQ2"
#string STR_CLKREQ_WWAN_HELP                              #language en-US "Enable or disable CLK_REQ2# for M.2 WWAN Slot J3712"
#string STR_CLKREQ_WIFI_STRING                            #language en-US "Clock PM: CLK_REQ3"
#string STR_CLKREQ_WIFI_HELP                              #language en-US "Enable or disable CLK_REQ3# for M.2 WIFI Slot J3709(From REV B)"
#string STR_CLKREQ_DT_STRING                              #language en-US "Clock PM: CLK_REQ4"
#string STR_CLKREQ_DT_HELP                                #language en-US "Enable or disable CLK_REQ4# for DT x4 Slot J3606"
#string STR_CLKREQ2_SSD_STRING                            #language en-US "Clock PM: CLK_REQ2"
#string STR_CLKREQ2_SSD_HELP                              #language en-US "Enable or disable CLK_REQ2# for M.2 SSD Slot J3704(From REV B)"
#string STR_CLKREQ_SSD_STRING                             #language en-US "Clock PM: CLK_REQ5"
#string STR_CLKREQ_SSD_HELP                               #language en-US "Enable or disable CLK_REQ5# for M.2 SSD Slot J3704(For REV A only)"

#string STR_CLKREQ_MXM_STRING                             #language en-US "Clock PM: CLK_REQ6"
#string STR_CLKREQ_MXM_HELP                               #language en-US "Enable or disable CLK_REQ6# for MXM x8 Slot J3604(For REV A only)"

#string STR_PSP_MITTWITT_STRING                           #language en-US "MITT/WITT Selection"
#string STR_PSP_MITT_STRING                               #language en-US "MITT Only"
#string STR_PSP_WITT_STRING                               #language en-US "WITT Only"
#string STR_PSP_NONE_STRING                               #language en-US "Both disable"

#string STR_LAN_POWER_STRING                              #language en-US "LAN Power Enable"
#string STR_LAN_POWER_HELP                                #language en-US "Enable or disable LAN Power"

#string STR_KBC_SUPPORT_STRING                            #language en-US "KBC Support"
#string STR_KBC_SUPPORT_HELP                              #language en-US "Enable/Disable KBC Support under OS"

#string STR_SATA_HDD_POWER_CONTROL_STRING                 #language en-US "HDD Power Enable"
#string STR_SATA_HDD_POWER_CONTROL_HELP                   #language en-US "Enable or disable the power of HDD"

#string STR_SATA_ODD_POWER_CONTROL_STRING                 #language en-US "ODD Power Enable"
#string STR_SATA_ODD_POWER_CONTROL_HELP                   #language en-US "Enable or disable the power of ODD"

#string STR_AMDODDZP_STRING                               #language en-US "Zero-Power ODD"
#string STR_AMDODDZP_HELP                                 #language en-US "Enable/Disable Zero-Power ODD Feature"

#string STR_SATA_SSD_POWER_CONTROL_STRING                 #language en-US "SSD Power Enable"
#string STR_SATA_SSD_POWER_CONTROL_HELP                   #language en-US "Enable or disable the power of SSD"

#string STR_REARCAMERA_POWER_CONTROL_STRING               #language en-US "Camera 0 Enable"
#string STR_REARCAMERA_POWER_CONTROL_HELP                 #language en-US "Enable or disable the power of REAR CAMERA"

#string STR_FRONTCAMERA_POWER_CONTROL_STRING              #language en-US "Camera 1 Enable"
#string STR_FRONTCAMERA_POWER_CONTROL_HELP                #language en-US "Enable or disable the power of FRONT CAMERA"

#string STR_PCIE_WLAN_POWER_ENABLE_STRING                 #language en-US "WLAN/WIFI Power Enable"
#string STR_PCIE_WLAN_POWER_ENABLE_HELP                   #language en-US "Enable or disable the power of WLAN/WIFI"

#string STR_WWAN_POWER_STRING                             #language en-US "WWAN Power Enable"
#string STR_WWAN_POWER_ENABLE_HELP                        #language en-US "Enable or disable the power of WWAN"

#string STR_DT_HOTPLUG_ENABLE_STRING                      #language en-US "DT Hotplug Enable"
#string STR_DT_HOTPLUG_ENABLE_HELP                        #language en-US "Enable or Disable DT Hotplug, it uses EC DOCK_IN# pin as plug-in event."
#string STR_DT_HOTPLUG_MODE_STRING                        #language en-US "DT Hotplug Mode"
#string STR_DT_HOTPLUG_MODE_HELP                          #language en-US "Select DT Hotplug Mode - DxioHotplugEnhanced or DxioHotplugBasic"
#string STR_BASIC_TEXT                                    #language en-US "Basic Mode"
#string STR_ENHANCED_TEXT                                 #language en-US "Enhanced Mode"

#string STR_DT_POWER_STRING                               #language en-US "DT Slot Power Enable"
#string STR_DT_POWER_HELP                                 #language en-US "Enable or disable the power of DT SLOT"

#string STR_EVAL_AUTO_DETECTION_STRING                    #language en-US "Eval Auto Detection"
#string STR_EVAL_AUTO_DETECTION_HELP                      #language en-US "Disable or enable EVAL card auto detection"

#string STR_SD_CONFIGURATION_STRING                       #language en-US "SD Configuration Mode"
#string STR_SD_CONFIGURATION_HELP                         #language en-US "Select SD Mode"
#string STR_VER2_DOT_0_TEXT                               #language en-US "Ver2.0"
#string STR_VER3_DOT_0_TEXT                               #language en-US "Ver3.0"
#string STR_VER3_SDR50_TEXT                               #language en-US "V3_SDR50"
#string STR_VER3_SDR104_TEXT                              #language en-US "V3_SDR104"
#string STR_VER3_DDR50_TEXT                               #language en-US "V3_DDR50"
#string STR_SDDUMP_TEXT                                   #language en-US "SdDump"

#string STR_M2_CONNECTION_CONTROL_STRING                  #language en-US "M.2 Slot Lane control"
#string STR_M2_CONNECTION_CONTROL_HELP                    #language en-US "Set the M.2 Slot to 1 x2 or 2 x1"
#string STR_2_X1_TEXT                                     #language en-US "2 x1 Slot"
#string STR_1_X2_TEXT                                     #language en-US "1 x2 Slot"

#string STR_SD_POWER_STRING                               #language en-US "SD Power Enable"
#string STR_SD_POWER_HELP                                 #language en-US "Enable or disable the power of SD"

#string STR_TOUCH_PANEL_STRING                            #language en-US "Touch Panel Support"
#string STR_TOUCH_PANEL_HELP                              #language en-US "Enable/Disable exposing of _HID(PNP0C50) in ACPI ASL code to OS"
#string STR_TOUCH_PAD_STRING                              #language en-US "Touch Pad Support"
#string STR_TOUCH_PAD_HELP                                #language en-US "Enable/Disable exposing of _HID(PNP0C50) in ACPI ASL code to OS"
#string STR_NFC_SENSOR_STRING                             #language en-US "Nfc Support"
#string STR_NFC_SENSOR_HELP                               #language en-US "Enable/Disable exposing of _HID(BCM2F25) in ACPI ASL code to OS"
#string STR_I2C0_TEXT                                     #language en-US "Under I2C 0 Bus"
#string STR_I2C1_TEXT                                     #language en-US "Under I2C 1 Bus"
#string STR_I2C2_TEXT                                     #language en-US "Under I2C 2 Bus"
#string STR_I2C3_TEXT                                     #language en-US "Under I2C 3 Bus"

#string STR_PBS_HDTOUT_STRING                             #language en-US "HDT OUT"
#string STR_PBS_HDTOUT_HELP                               #language en-US "Enable/Disable HDTOUT function"

#string STR_MANUAL_BY_JUMPER_STRING                       #language en-US "Manual by jumper"

#string STR_HDMI_OVER_USB_C0_STRING                       #language en-US "HDMI over USB-C0"
#string STR_HDMI_OVER_USB_C1_STRING                       #language en-US "HDMI over USB-C1"
#string STR_HDMI_OVER_USB_HELP                            #language en-US "Force HDMI signals route over USB Type C port"
#string STR_NATIVE_USB_C_TEXT                             #language en-US "Native USB Type-C"
#string STR_HDMI_USB_C_TEXT                               #language en-US "HDMI over USB Type-C"

#string STR_KBC_SUPPORT_STRING                            #language en-US "KBC Support"
#string STR_KBC_SUPPORT_HELP                              #language en-US "Enable/Disable KBC Support under OS"

#string STR_AMDACDCSWITCH_STRING                          #language en-US "AcDcSwitch"
#string STR_AMDACDCSWITCH_HELP                            #language en-US "Enable/disable AcDcSwitch."
#string STR_AMDDCTIMER_STRING                             #language en-US "AmdDcTimer"
#string STR_AMDDCTIMER_HELP                               #language en-US "AmdDcTimer Setting."
#string STR_AMDACTIMER_STRING                             #language en-US "AmdAcTimer"
#string STR_AMDACTIMER_HELP                               #language en-US "AmdAcTimer Setting."

#string STR_SATASELECTION_STRING                          #language en-US "SATA/ M.2 selection"
#string STR_SATASELECTION_HELP                            #language en-US "SATA / SATA M.2 / PCIe M.2 selection. Note: When M.2 x1 is selected, SATA Port0 will be mapped to M.2 x1 and SATA Port1 to SATA port"
#string STR_SATA_TEXT                                     #language en-US "SATA"
#string STR_SATA_M2_X2_TEXT                               #language en-US "SATA M.2 x2"
#string STR_SATA_M2_X1_TEXT                               #language en-US "SATA M.2 x1"
#string STR_PCIE_M2_X2_TEXT                               #language en-US "Pcie M.2 x2"
#string STR_PCIE_M2_X1_TEXT                               #language en-US "Pcie M.2 x1"

#string STR_XGBE_PORT_0_SPEED_SELECT_STRING               #language en-US "Ethernet Port-0 Speed Selection"
#string STR_XGBE_PORT_1_SPEED_SELECT_STRING               #language en-US "Ethernet Port-1 Speed Selection"
#string STR_XGBE_PORT_SPEED_SELECT_HELP                   #language en-US "Option to select the Port Speed. By default, 1G is enabled."
#string STR_XGBE_PORT_SPEED_1G                            #language en-US "1G"
#string STR_XGBE_PORT_SPEED_10G                           #language en-US "10G"
#string STR_XGBE_PORT_SPEED_100M                          #language en-US "100Mbps"
#string STR_XGBE_PORT_SPEED_10M                           #language en-US "10Mbps"
#string STR_XGBE_PORT_SPEED_ALL                           #language en-US "10G/1G"
#string STR_XGBE_PORT_SPEED_10_100_1G                     #language en-US "10M/100M/1G"
#string STR_XGBE_PORT_SPEED_2_5G                          #language en-US "2.5G"

#string STR_XGBE_PORT_0_PHY_SELECT_STRING                 #language en-US "Ethernet Port-0 PHY Interface Selection"
#string STR_XGBE_PORT_1_PHY_SELECT_STRING                 #language en-US "Ethernet Port-1 PHY Interface Selection"
#string STR_XGBE_PORT_PHY_SELECT_HELP                     #language en-US "This option allows to select external PHY type. BackPlane interface will not use any External PHY."
#string STR_XGBE_PORT_PHY_RJ45                            #language en-US "RJ45 Ports"
#string STR_XGBE_PORT_PHY_SFP                             #language en-US "SFP+ Ports"
#string STR_XGBE_PORT_PHY_BACKPLANE                       #language en-US "BackPlane"


#string STR_XGBE_PORT_RJ45_MODE_SELECT_HELP          #language en-US "This option allows to select the Port mode for xgbe \n 10G/1G(10G BaseT over BP) will support up to 10G \n For 1G PHYs select 1000base-T( supports up to 1G speed ) \n For 10G PHYs & Nbase-T PHYs select NBase-T (supports up to 1G)"
#string STR_XGBE_PORT_0_RJ45_MODE_SELECT_STRING      #language en-US "XGBE Port-0 Mode"
#string STR_XGBE_PORT_1_RJ45_MODE_SELECT_STRING      #language en-US "XGBE Port-1 Mode"
#string STR_XGBE_PORT_MODE_10_1_RJ45                 #language en-US "10G/1G(10G BaseT over BP)"
#string STR_XGBE_PORT_MODE_10_1_BACKPLANE            #language en-US "10G/1G Backplane"
#string STR_XGBE_PORT_MODE_2_5_BACKPLANE             #language en-US "2.5G Backplane"
#string STR_XGBE_PORT_MODE_1000BASET                 #language en-US "Soldered down 1000Base-T"
#string STR_XGBE_PORT_MODE_1000BASEX                 #language en-US "Soldered down 1000Base-X"
#string STR_XGBE_PORT_MODE_NBASET                    #language en-US "Soldered down NBase-T"
#string STR_XGBE_PORT_MODE_10GBASET                  #language en-US "Soldered down 10GBase-T"
#string STR_XGBE_PORT_MODE_10GBASER                  #language en-US "Soldered down 10GBase-R"
#string STR_XGBE_PORT_MODE_SFP                       #language en-US "SFP+ Connector"
#string STR_XGBE_PORT_MODE_SGMIBP                    #language en-US "SGMII BackPlane"
#string STR_XGBE_PORT_MODE_1G_BP_FIXED_CONFIG        #language en-US "1G BackPlane Fixed Config"

#string STR_VDDP_STRING                                   #language en-US "VDDP voltage"
#string STR_VDDP_HELP                                     #language en-US "VDDP voltage  Setting."
#string STR_VDDP_DEFAULT                                  #language en-US "VDDP voltage (0.9V)"
#string STR_VDDP_0010_TEXT                                #language en-US "VDDP voltage (+10mv)"
#string STR_VDDP_0020_TEXT                                #language en-US "VDDP voltage (+20mv)"
#string STR_VDDP_0030_TEXT                                #language en-US "VDDP voltage (+30mv)"
#string STR_VDDP_0040_TEXT                                #language en-US "VDDP voltage (+40mv)"
#string STR_VDDP_0050_TEXT                                #language en-US "VDDP voltage (+50mv)"
#string STR_VDDP_0060_TEXT                                #language en-US "VDDP voltage (+60mv)"
#string STR_VDDP_0070_TEXT                                #language en-US "VDDP voltage (+70mv)"
#string STR_VDDP_0080_TEXT                                #language en-US "VDDP voltage (+80mv)"
#string STR_VDDP_0090_TEXT                                #language en-US "VDDP voltage (+90mv)"
#string STR_VDDP_0100_TEXT                                #language en-US "VDDP voltage (+100mv)"
#string STR_VDDP_1010_TEXT                                #language en-US "VDDP voltage (-10mv)"
#string STR_VDDP_1020_TEXT                                #language en-US "VDDP voltage (-20mv)"
#string STR_VDDP_1030_TEXT                                #language en-US "VDDP voltage (-30mv)"
#string STR_VDDP_1040_TEXT                                #language en-US "VDDP voltage (-40mv)"
#string STR_VDDP_1050_TEXT                                #language en-US "VDDP voltage (-50mv)"
#string STR_VDDP_1060_TEXT                                #language en-US "VDDP voltage (-60mv)"
#string STR_VDDP_1070_TEXT                                #language en-US "VDDP voltage (-70mv)"
#string STR_VDDP_1080_TEXT                                #language en-US "VDDP voltage (-80mv)"
#string STR_VDDP_1090_TEXT                                #language en-US "VDDP voltage (-90mv)"
#string STR_VDDP_1100_TEXT                                #language en-US "VDDP voltage (-100mv)"

#string STR_VDD18_STRING                                  #language en-US "VDD18 voltage"
#string STR_VDD18_HELP                                    #language en-US "VDD18 voltage  Setting."
#string STR_VDD18_DEFAULT                                 #language en-US "VDD18 voltage (1.8V)"
#string STR_VDD18_0040_TEXT                               #language en-US "VDD18 voltage (+40mv)"
#string STR_VDD18_0050_TEXT                               #language en-US "VDD18 voltage (+50mv)"
#string STR_VDD18_0060_TEXT                               #language en-US "VDD18 voltage (+60mv)"
#string STR_VDD18_0070_TEXT                               #language en-US "VDD18 voltage (+70mv)"
#string STR_VDD18_0080_TEXT                               #language en-US "VDD18 voltage (+80mv)"
#string STR_VDD18_0090_TEXT                               #language en-US "VDD18 voltage (+90mv)"
#string STR_VDD18_0100_TEXT                               #language en-US "VDD18 voltage (+100mv)"
#string STR_VDD18_0110_TEXT                               #language en-US "VDD18 voltage (+110mv)"
#string STR_VDD18_0120_TEXT                               #language en-US "VDD18 voltage (+120mv)"
#string STR_VDD18_0130_TEXT                               #language en-US "VDD18 voltage (+130mv)"
#string STR_VDD18_1040_TEXT                               #language en-US "VDD18 voltage (-40mv)"
#string STR_VDD18_1050_TEXT                               #language en-US "VDD18 voltage (-50mv)"
#string STR_VDD18_1060_TEXT                               #language en-US "VDD18 voltage (-60mv)"
#string STR_VDD18_1070_TEXT                               #language en-US "VDD18 voltage (-70mv)"
#string STR_VDD18_1080_TEXT                               #language en-US "VDD18 voltage (-80mv)"
#string STR_VDD18_1090_TEXT                               #language en-US "VDD18 voltage (-90mv)"
#string STR_VDD18_1100_TEXT                               #language en-US "VDD18 voltage (-100mv)"
#string STR_VDD18_1110_TEXT                               #language en-US "VDD18 voltage (-110mv)"
#string STR_VDD18_1120_TEXT                               #language en-US "VDD18 voltage (-120mv)"
#string STR_VDD18_1130_TEXT                               #language en-US "VDD18 voltage (-130mv)"
#string STR_VDDP0_80_TEXT                                 #language en-US "VDDP voltage (0.8V)"
#string STR_AMD_KVM_MOUSE_PROTOCOL_STRING                 #language en-US "AMD KVM Mouse Protocol"
#string STR_AMD_KVM_MOUSE_PROTOCOL_HELP                   #language en-US "Swtich KVM Mouse Protocol between Absolut/Simple"
#string STR_AMD_KVM_ABSOLUTE_PROTOCOL                     #language en-US "Absolute"
#string STR_AMD_KVM_SIMPLE_PROTOCOL                       #language en-US "Simple"
#string STR_VDDP0_80_TEXT                                 #language en-US "VDDP voltage (0.8V)"

#string STR_AMD_DPTC_CTRL_STRING                          #language en-US "AMD DPTC interface"
#string STR_AMD_DPTC_CTRL_HELP                            #language en-US "Dynamic Power and Thermal Control Interface Enable/Disable"

#string STR_AMD_STALLFORUNLOCK_STRING                     #language en-US "StallForUnlock"
#string STR_AMD_STALLFORUNLOCK_HELP                       #language en-US "StallForUnlock Enable/Disable"

#string STR_AMD_HDTBREAKPOINTBOOT_STRING                  #language en-US "HDT BreakPoint for Boot"
#string STR_AMD_HDTBREAKPOINTBOOT_HELP                    #language en-US "HDT BreakPoint for Boot Enable/Disable"

#string STR_AMD_HDTBREAKPOINTS3_STRING                    #language en-US "SW BreakPoint for S3"
#string STR_AMD_HDTBREAKPOINTS3_HELP                      #language en-US "SW BreakPoint for S3 Enable/Disable"

#string STR_AMD_BLINK_LED_STRING                          #language en-US "BLINK LED"
#string STR_AMD_BLINK_LED_HELP                            #language en-US "Enable/Disable BLINK LED to identify S3/S4 state"
#string STR_GPIO11_LOW_TEXT                               #language en-US "GPIO 11 Output Low"
#string STR_GPIO11_HIGH_TEXT                              #language en-US "GPIO 11 Output High"

#string STR_SLT_CONFIG_CHECK                              #language en-US "SLT Configuration Check"
#string STR_AMD_PBS_FWVER_FORM_TITLE                      #language en-US "AMD Firmware Version"
#string STR_AMD_PBS_FWVER_FORM_HELP                       #language en-US "Show all of AMD Firmware Version"
#string STR_AMD_PBS_FWVER_AGESA_STRING                    #language en-US "AGESA Version"
#string STR_AMD_PBS_FWVER_AGESA_VALUE                     #language en-US "0"
#string STR_AMD_PBS_FWVER_PSP_BOOT_LOADER_STRING          #language en-US "PSP BootLoader Version"
#string STR_AMD_PBS_FWVER_PSP_BOOT_LOADER_VALUE           #language en-US "0"
#string STR_AMD_PBS_FWVER_PSP_TRUSTED_OS_STRING           #language en-US "PSP SecureOS Version"
#string STR_AMD_PBS_FWVER_PSP_TRUSTED_OS_VALUE            #language en-US "0"
#string STR_AMD_PBS_FWVER_ABL_STRING                      #language en-US "ABL Version"
#string STR_AMD_PBS_FWVER_ABL_VALUE                       #language en-US "0"
#string STR_AMD_PBS_FWVER_APCB_STRING                     #language en-US "APCB Version"
#string STR_AMD_PBS_FWVER_APCB_VALUE                      #language en-US "0"
#string STR_AMD_PBS_FWVER_APOB_STRING                     #language en-US "APOB Version"
#string STR_AMD_PBS_FWVER_APOB_VALUE                      #language en-US "0"
#string STR_AMD_PBS_FWVER_UCODE_STRING                    #language en-US "Ucode Patch Version"
#string STR_AMD_PBS_FWVER_UCODE_VALUE                     #language en-US "0"
#string STR_AMD_PBS_FWVER_SMU_STRING                      #language en-US "SMU FW Version"
#string STR_AMD_PBS_FWVER_SMU_VALUE                       #language en-US "0"
#string STR_AMD_PBS_FWVER_SMU_RV2_STRING                  #language en-US "SMU RV2/PCO FW Version"
#string STR_AMD_PBS_FWVER_SMU_RV2_VALUE                   #language en-US "0"
#string STR_AMD_PBS_FWVER_DXIO_STRING                     #language en-US "DXIO FW Version"
#string STR_AMD_PBS_FWVER_DXIO_VALUE                      #language en-US "0"
#string STR_AMD_PBS_FWVER_MP2_STRING                      #language en-US "MP2 I2C FW Version"
#string STR_AMD_PBS_FWVER_MP2_VALUE                       #language en-US "0"
#string STR_AMD_PBS_FWVER_MP2_RV2_STRING                  #language en-US "MP2 I2C RV2/PCO FW Version"
#string STR_AMD_PBS_FWVER_MP2_RV2_VALUE                   #language en-US "0"
#string STR_AMD_PBS_FWVER_XHCI_STRING                     #language en-US "XHCI FW Version"
#string STR_AMD_PBS_FWVER_XHCI_VALUE                      #language en-US "0"
#string STR_AMD_PBS_FWVER_VBIOS_STRING                    #language en-US "VBIOS FW Version"
#string STR_AMD_PBS_FWVER_VBIOS_VALUE                     #language en-US "0"
#string STR_AMD_PBS_FWVER_GOP_STRING                      #language en-US "GOP Driver Version"
#string STR_AMD_PBS_FWVER_GOP_VALUE                       #language en-US "0"
#string STR_ABOVE_4G_LIMIT_STRING                         #language en-US "Above 4GB MMIO Limit"
#string STR_ABOVE_4G_LIMIT_HELP                           #language en-US "Select Above 4GB MMIO Limit to 35~48bits limit."
#string STR_ABOVE_4G_LIMIT_35                             #language en-US "35bit (32GB)"
#string STR_ABOVE_4G_LIMIT_36                             #language en-US "36bit (64GB)"
#string STR_ABOVE_4G_LIMIT_37                             #language en-US "37bit (128GB)"
#string STR_ABOVE_4G_LIMIT_38                             #language en-US "38bit (256GB)"
#string STR_ABOVE_4G_LIMIT_39                             #language en-US "39bit (512GB)"
#string STR_ABOVE_4G_LIMIT_40                             #language en-US "40bit (1TB)"
#string STR_ABOVE_4G_LIMIT_41                             #language en-US "41bit (2TB)"
#string STR_ABOVE_4G_LIMIT_42                             #language en-US "42bit (4TB)"
#string STR_ABOVE_4G_LIMIT_43                             #language en-US "43bit (8TB)"
#string STR_ABOVE_4G_LIMIT_44                             #language en-US "44bit (16TB)"
#string STR_ABOVE_4G_LIMIT_45                             #language en-US "45bit (32TB)"
#string STR_ABOVE_4G_LIMIT_46                             #language en-US "46bit (64TB)"
#string STR_ABOVE_4G_LIMIT_47                             #language en-US "47bit (128TB)"
#string STR_ABOVE_4G_LIMIT_48                             #language en-US "48bit (256TB)"
#string STR_DISPLAY_TYPE_SELECT_STRING1                   #language en-US "Display Selection 1"
#string STR_DISPLAY_TYPE_SELECT_HELP1                     #language en-US "Select DP0 or HDMI0 as Display"
#string STR_DISPLAY_TYPE_SELECT_STRING2                   #language en-US "Display Selection 2"
#string STR_DISPLAY_TYPE_SELECT_HELP2                     #language en-US "Select DP1 or HDMI1 as Display"
#string STR_DISPLAY_TYPE_HDMI                             #language en-US "HDMI"
#string STR_DISPLAY_TYPE_DP                               #language en-US "DP"
#string STR_XGBE_VS_PCIEX2_SELECT_STRING                  #language en-US "XGbe / NVME Xn"
#string STR_XGBE_VS_PCIEX2_SELECT_HELP                    #language en-US "For V1000 only XGBE and Nvme, M.2 NVME X4 are supported"
#string STR_XGBE_VS_PCIEX2_XGBE                           #language en-US "XGBE and M.2 Sata"
#string STR_XGBE_VS_PCIEX2_XGBE_X2NVME                    #language en-US "XGBE and M.2 NvME"
#string STR_XGBE_VS_PCIEX2_PCIEX2                         #language en-US "M.2 NVME X2"
#string STR_XGBE_VS_PCIEX2_PCIEX4                         #language en-US "M.2 NVME X4"
#string STR_PXE_BOOT_SELECT_STRING                        #language en-US "PXE BOOT"
#string STR_PXE_BOOT_PORT_0                               #language en-US "PORT 0"
#string STR_PXE_BOOT_PORT_1                               #language en-US "PORT 1"
#string STR_PXE_BOOT_SELECT_HELP                          #language en-US "PXE BOOT is disabled by default. PORT0 or PORT 1 can be enabled at a time"

